var src_layer= [['marker','marker',[23, 32],[11, 32]],
		['Cave','Пещера',[25, 41],[12, 41]],
		['Base','место под базу',[23, 32],[11, 32]],
		['Artefact','Артефакт',[23, 32],[11, 32]],
		['Note','Заметка',[23, 32],[11, 32]],
		['Metal','Металл',[25, 28],[12, 28]],
		['Crystal','Кристаллы',[25, 28],[12, 28]],
		['interest','Достопримечательность',[23, 32],[11, 32]],
		['Oil','Нефть',[25, 28],[12, 28]],
		['lut','Лут',[23, 32],[11, 32]],
];
//   alert( src_layer[0][2] );
var layer = {};
var overlays = {};
var layerSearch={};		
for (var i in src_layer){
        var s = src_layer[i];	
	layer[s[0]] = new L.LayerGroup();
	overlays['<big>'+s[1]+'</big>'] = layer[s[0]];
	layerSearch[i]=layer[s[0]];
 };

var layerSearch= L.layerGroup([
	layer["marker"], layer["Cave"], layer["Base"], layer["Artefact"], layer["Note"], layer["Metal"], layer["Crystal"], layer["interest"], layer["Oil"], layer["lut"]]);


var markerIconTypes = [];
for (var i in src_layer){
	var icon = src_layer[i][0];
	markerIconTypes[i] = L.icon({
		iconUrl: 'images/markers/' + icon.replace(/ /g, "") + '.png',
		iconSize: src_layer[i][2],
		iconAnchor: src_layer[i][3],
		popupAnchor: [0, -30]
		});
	};

L.CRS.Wall = L.extend({}, L.CRS.Simple, {
	transformation: new L.Transformation(1, 0, 1, 0)});	

var layerBaseMap = L.imageOverlay('map/The_Island.png', [[-2.4, -1.5], [101.3, 99.5]]);
var layerBaseMap2 = L.imageOverlay('map/The_Island_Topographic_Map.jpg', [[6.3, 7.5], [93.5, 90]]);///не выровненно
//var layerBaseMap = L.imageOverlay('map/The_Island_Grid.jpg', [[6.3, 7.5], [93.5, 90]]);



var map = L.map('map', {
		crs: L.CRS.Wall,
		minZoom: 3,
		maxZoom: 8,
	        layers:[layerBaseMap, layerSearch],
	        noWrap: true,
	        fullscreenControl: true,
	        fullscreenControlOptions: {position: 'topleft' },
		}).setView([50, 50], 3);


var baseMaps = { 
	'Основная карта': layerBaseMap,
	'Топографичечкая карта': layerBaseMap2,
};

//map.fitBounds([[0,0], [100,100]]);



L.control.layers(baseMaps, overlays).addTo(map);
var hash = new L.Hash(map);

	
var controlSearch = new L.Control.Search({
		position:'topright',
		layer: layerSearch,		
//		layer: [overlays],
		initial: false,
		zoom: 5,
		marker: false,
		textErr: 'Место не найдено',
		textCancel: 'Сбросить',			
		textPlaceholder: 'Поиск…       ',	
	});
map.addControl( controlSearch );





 var array_markers= [
/*[0, 0, 0, "test ",''],
[0, 10, 10, "test ",''],
[0, 20, 20, "test ",''],
[0, 10, 90, "test ",''],
[0, 80, 80, "test ",''],
[0, 90, 90, "test ",''],
[0, 100, 100, "test ",''],
*/
[0, 79.8, 17.4, 'Красный Обелиск', ''],
[0, 25.5, 25.6, 'Синий Обелиск', ''],
[0, 59.0, 72.3, 'Зеленый Обелиск', ''],

[1, 41.6, 47.0, 'Центральная пещера', ''],
[1, 19.2, 19.0, 'Северо-западная пещера', ''],
[1, 80.2, 53.5, 'Нижняя южная пещера', ''],
[1, 14.8, 85.3, 'Северо-восточная пещера', ''],
[1, 68.2, 56.1, 'Верхняя Южная пещера', ''],
[1, 70.6, 86.1, 'Юго-восточная пещера', ''],
[1, 62.7, 37.3, 'Болотная пещера', ''],
[1, 29.1, 31.8, 'Снежная пещера', ''],
[1, 53.7, 10.4, 'Пещеры утраченной веры', ''],
[1, 45.9, 88.9, 'Пещеры потерянной надежды', ''],
[1, 43.2, 39.1, 'Tek Пещера', ''],


[3, 16.1, 84.6, 'Артефакт Пожирателя', ''],
[3, 19.6, 18.4, 'Артефакт Небесного Лорда', ''],
[3, 29.9, 26.5, 'Артефакт Силы', ''],
[3, 39.6, 45.9, 'Артефакт Мудрости', 'вход 41.6 47'],
[3, 46.4, 83.4, 'Артефакт Хитрости', ''],
[3, 60.9, 22, 'Артефакт Жестокости', 'вход 53.7 10.4'],
[3, 62.2, 39.6, 'Артефакт Неуязвимости', ''],
[3, 67.1, 86, 'Артефакт Артефакт Целостности', 'вход 70.6 86.1'],
[3, 73, 61, 'Артефакт из стаи', ''],
[3, 83.5, 56, 'Артефакт Охотника', ''],

[1, 16.0, 10.1, 'Cave', ''],
[1, 10.0, 21.5, 'Cave', ''],
[1, 10.4, 39.5, 'Cave', ''],
[1, 7.9, 90.1, 'Cave', ''],
[1, 36.3, 91.5, 'Cave', ''],
[1, 50.5, 11.2, 'Cave', ''],
[1, 52.7, 91.9, 'Cave', ''],
[1, 83.0, 09.9, 'Cave', ''],
[1, 90.8, 13.0, 'Cave', ''],
[1, 89.8, 36.8, 'Cave', ''],
[1, 90.3, 71.3, 'Cave', ''],
[1, 87.1, 90.2, 'Cave', ''],

[4, 75.8, 78.2, 'Досье: Ахатина', ''],
[4, 87.5, 51.5, 'Досье: Аммонит', ''],
[4, 24.6, 40.1, 'Досье: Удильщик', ''],
[4, 15.8, 26.7, 'Досье: Анкилозавр', ''],
[4, 18.7, 42.8, 'Досье: Археоптерикс', ''],
[4, 21.6, 53.9, 'Досье: Аргентавис', ''],
[4, 14.2, 69.1, 'Досье: Артроплевра', ''],
[4, 30, 78.1, 'Досье: Барионикс', ''],
[4, 52.5, 17.7, 'Досье: Базилозавр', ''],
[4, 70.7, 61.1, 'Досье: Гигантская пчела', ''],
[4, 14.8, 81.4, 'Досье: Жаба', ''],
[4, 31.6, 17.1, 'Досье: Бронтозавр', ''],
[4, 33.3, 41, 'Досье: Карнотавр', ''],
[4, 25.1, 71.8, 'Досье: Кастороидес', ''],
[4, 31.3, 28.9, 'Досье: Халикотерий', ''],
[4, 37, 49.9, 'Досье: Латимерия', ''],
[4, 41.2, 49.2, 'Досье: Компсогнат', ''],
[4, 88.1, 53, 'Досье: Деодон', ''],
[4, 28.5, 74.2, 'Досье: Диметродон', ''],
[4, 26.6, 70.6, 'Досье: Диморфодон', ''],
[4, 27.6, 82.6, 'Досье: Диплокаулус', ''],
[4, 25.1, 13.5, 'Досье: Диплодок', ''],
[4, 40.4, 83.8, 'Досье: Свирепый медведь', ''],
[4, 42.5, 20.8, 'Досье: Лютоволк', ''],
[4, 56.7, 21.4, 'Досье: Додо', ''],
[4, 47, 27.5, 'Досье: Дедикурус', ''],
[4, 16.5, 85, 'Досье: Скарабей', ''],
[4, 44, 55.2, 'Досье: Дунклеостей', ''],
[4, 36.4, 81.4, 'Досье: Электрофорус', ''],
[4, 63.6, 33.4, 'Досье: Эквус', ''],
[4, 44.1, 49, 'Досье: Ракоскорпион', ''],
[4, 45.6, 62.3, 'Досье: Галлимим', ''],
[4, 44, 66.4, 'Досье: Гиганотозавр', ''],
[4, 26.6, 23.6, 'Досье: Гигантопитек', ''],
[4, 81.7, 84.1, 'Досье: Гесперорнис', ''],
[4, 80.9, 81.9, 'Досье: Гиенодон', ''],
[4, 72.8, 64.5, 'Досье: Ихтиорнис', ''],
[4, 52.9, 79.8, 'Досье: Ихтиозавр', ''],
[4, 62.4, 24.7, 'Досье: Игуанодон', ''],
[4, 42.5, 79.6, 'Досье: Кайруку', ''],
[4, 78.3, 23.6, 'Досье: Кентрозавр', ''],
[4, 83.1, 23.5, 'Досье: Лидсихтис', ''],
[4, 78.2, 24.4, 'Досье: Лиоплевродон', ''],
[4, 84.4, 84.1, 'Досье: Мегалания', ''],
[4, 54.3, 41.4, 'Досье: Стрекоза', ''],
[4, 68.1, 67.6, 'Досье: Пиранья', ''],
[4, 75, 21.4, 'Досье: Мегатерий', ''],
[4, 48.5, 21.6, 'Досье: Микрораптор', ''],
[4, 64.3, 17.4, 'Досье: Мосхопс', ''],
[4, 66.4, 19.7, 'Досье: Оник', ''],
[4, 35.7, 59.1, 'Досье: Выдра', ''],
[4, 58.9, 23.1, 'Досье: Овираптор', ''],
[4, 73.3, 74.1, 'Досье: Овис', ''],
[4, 65.5, 40.8, 'Досье: Пахицефалозавр', ''],
[4, 77.6, 20.7, 'Досье: Пахиринозавр', ''],
[4, 65.1, 31.4, 'Досье: Парацератерий', ''],
[4, 71.5, 32.1, 'Досье: Паразавр', ''],
[4, 82.2, 62.9, 'Досье: Пегомастакс', ''],
[4, 71.3, 47.2, 'Досье: Пелагорнис', ''],
[4, 72.5, 53.8, 'Досье: Фиомия', ''],
[4, 68.4, 59.5, 'Досье: Плезиозавр', ''],
[4, 72.3, 78.2, 'Досье: Прокоптодон', ''],
[4, 66.9, 76.8, 'Досье: Птеранодон', ''],
[4, 80.6, 61.9, 'Досье: Скорпион', ''],
[4, 36.6, 34.9, 'Досье: Пурловия', ''],
[4, 87.4, 23.3, 'Досье: Кетцалькоатль', ''],
[4, 86.8, 25, 'Досье: Раптор', ''],
[4, 77.1, 26.1, 'Досье: Саблезуб', ''],
[4, 87.5, 52.5, 'Досье: Саблезубый лосось', ''],
[4, 77.9, 42.9, 'Досье: Саркозух', ''],
[4, 75.7, 79.8, 'Досье: Спинозавр', ''],
[4, 78.3, 79.1, 'Досье: Стегозавр', ''],
[4, 67.6, 48.5, 'Досье: Теризинозавр', ''],
[4, 32.4, 66.2, 'Досье: Сумчатый лев', ''],
[4, 75, 78.8, 'Досье: Троодон', ''],
[4, 79.2, 32.3, 'Досье: Шерстистый носорог', ''],
[4, 73.9, 23.6, 'Досье: Ютираннус', ''],
[4, 81.5, 44.7, 'Заметка: Заметка Хелены #5', ''],
[4, 77.2, 76.4, 'Заметка: Заметка Хелены #6', ''],
[4, 78.8, 27.7, 'Заметка: Заметка Хелены #7', ''],
[4, 61.2, 81.5, 'Заметка: Заметка Хелены #8', ''],
[4, 52.4, 59, 'Заметка: Заметка Хелены #10', ''],
[4, 55.2, 27.7, 'Заметка: Заметка Хелены #13', ''],
[4, 26.3, 62.9, 'Заметка: Заметка Хелены #14', ''],
[4, 34.1, 56.1, 'Заметка: Заметка Хелены #15', ''],
[4, 40.7, 26.1, 'Заметка: Заметка Хелены #16', ''],
[4, 76.8, 77.3, 'Заметка: Заметка Хелены #17', ''],
[4, 76.6, 70.7, 'Заметка: Заметка Хелены #18', ''],
[4, 25.1, 44.6, 'Заметка: Заметка Хелены #19', ''],
[4, 19.2, 49.9, 'Заметка: Заметка Хелены #20', ''],
[4, 12.6, 49.3, 'Заметка: Заметка Хелены #21', ''],
[4, 24.9, 60.9, 'Заметка: Заметка Хелены #22', ''],
[4, 23.9, 65.3, 'Заметка: Заметка Хелены #23', ''],
[4, 28.9, 23.2, 'Заметка: Заметка Хелены #24', ''],
[4, 36.2, 22.4, 'Заметка: Заметка Хелены #25', ''],
[4, 27.7, 56.4, 'Заметка: Заметка Хелены #26', ''],
[4, 26, 25.6, 'Заметка: Заметка Хелены #27', ''],
[4, 22.3, 23.4, 'Заметка: Заметка Хелены #28', ''],
[4, 16.3, 81.2, 'Заметка: Заметка Хелены #29', ''],
[4, 25, 18.9, 'Заметка: Заметка Мей Инь #1', ''],
[4, 15.2, 20.7, 'Заметка: Заметка Мей Инь #2', ''],
[4, 15.8, 52.5, 'Заметка: Заметка Мей Инь #3', ''],
[4, 19.8, 30.1, 'Заметка: Заметка Мей Инь #4', ''],
[4, 26.6, 16.4, 'Заметка: Заметка Мей Инь #5', ''],
[4, 16.8, 29, 'Заметка: Заметка Мей Инь #6', ''],
[4, 21.3, 30, 'Заметка: Заметка Мей Инь #7', ''],
[4, 32.5, 16.1, 'Заметка: Заметка Мей Инь #8', ''],
[4, 27.3, 43.9, 'Заметка: Заметка Мей Инь #10', ''],
[4, 20.5, 40.8, 'Заметка: Заметка Мей Инь #11', ''],
[4, 12.8, 54.5, 'Заметка: Заметка Мей Инь #12', ''],
[4, 21.3, 40.9, 'Заметка: Заметка Мей Инь #13', ''],
[4, 15.3, 53.2, 'Заметка: Заметка Мей Инь #14', ''],
[4, 26.8, 39.7, 'Заметка: Заметка Мей Инь #15', ''],
[4, 34.4, 29.4, 'Заметка: Заметка Мей Инь #16', ''],
[4, 28, 33.9, 'Заметка: Заметка Мей Инь #17', ''],
[4, 26.6, 51.7, 'Заметка: Заметка Мей Инь #18', ''],
[4, 39, 44.1, 'Заметка: Заметка Мей Инь #19', ''],
[4, 39.1, 71.1, 'Заметка: Заметка Мей Инь #20', ''],
[4, 32.4, 73.3, 'Заметка: Заметка Мей Инь #21', ''],
[4, 30.1, 82.4, 'Заметка: Заметка Мей Инь #22', ''],
[4, 40.2, 78.8, 'Заметка: Заметка Мей Инь #23', ''],
[4, 50.5, 23.3, 'Заметка: Заметка Мей Инь #24', ''],
[4, 42.6, 23, 'Заметка: Заметка Мей Инь #25', ''],
[4, 52.4, 17.4, 'Заметка: Заметка Мей Инь #26', ''],
[4, 22.1, 9.7, 'Заметка: Заметка Мей Инь #27', ''],
[4, 23.5, 37.8, 'Заметка: Заметка Мей Инь #28', ''],
[4, 18.2, 38, 'Заметка: Заметка Мей Инь #29', ''],
[4, 39.9, 40.6, 'Заметка: Заметка Мей Инь #30', ''],
[4, 22.4, 68.5, 'Заметка: Заметка Нервы #1', ''],
[4, 35.7, 78.1, 'Заметка: Заметка Нервы #2', ''],
[4, 39.5, 24.5, 'Заметка: Заметка Нервы #3', ''],
[4, 41.2, 68, 'Заметка: Заметка Нервы #4', ''],
[4, 45.4, 31.5, 'Заметка: Заметка Нервы #5', ''],
[4, 49.4, 79, 'Заметка: Заметка Нервы #6', ''],
[4, 47.8, 60.9, 'Заметка: Заметка Нервы #7', ''],
[4, 52.5, 49.1, 'Заметка: Заметка Нервы #8', ''],
[4, 51.4, 54.6, 'Заметка: Заметка Нервы #10', ''],
[4, 82.7, 27.1, 'Заметка: Заметка Нервы #11', ''],
[4, 77.4, 16.4, 'Заметка: Заметка Нервы #12', ''],
[4, 69.6, 84.6, 'Заметка: Заметка Нервы #13', ''],
[4, 72.3, 59.2, 'Заметка: Заметка Нервы #14', ''],
[4, 62.1, 20.4, 'Заметка: Заметка Нервы #15', ''],
[4, 53.7, 77.8, 'Заметка: Заметка Нервы #16', ''],
[4, 43.3, 69.3, 'Заметка: Заметка Нервы #17', ''],
[4, 57.9, 32.2, 'Заметка: Заметка Нервы #18', ''],
[4, 43.4, 31, 'Заметка: Заметка Нервы #19', ''],
[4, 50.6, 38.5, 'Заметка: Заметка Нервы #20', ''],
[4, 54.8, 70.8, 'Заметка: Заметка Нервы #21', ''],
[4, 43.6, 61, 'Заметка: Заметка Нервы #22', ''],
[4, 45.4, 68.4, 'Заметка: Заметка Нервы #23', ''],
[4, 44.1, 77, 'Заметка: Заметка Нервы #24', ''],
[4, 55.2, 75.9, 'Заметка: Заметка Нервы #25', ''],
[4, 73.8, 17.6, 'Заметка: Заметка Нервы #26', ''],
[4, 56.2, 51.1, 'Заметка: Заметка Нервы #27', ''],
[4, 47.9, 47.5, 'Заметка: Заметка Нервы #28', ''],
[4, 71.2, 58, 'Заметка: Заметка Нервы #29', ''],
[4, 43, 39.2, 'Заметка: Заметка Нервы #30', ''],
[4, 25.3, 73.1, 'Заметка: Запись Роквелла #1', ''],
[4, 83.2, 24.8, 'Заметка: Запись Роквелла #2', ''],
[4, 54.8, 13.8, 'Заметка: Запись Роквелла #3', ''],
[4, 14.1, 85.9, 'Заметка: Запись Роквелла #4', ''],
[4, 21.3, 69.2, 'Заметка: Запись Роквелла #5', ''],
[4, 44.1, 81.4, 'Заметка: Запись Роквелла #7', ''],
[4, 64.5, 34.1, 'Заметка: Запись Роквелла #8', ''],
[4, 75.7, 71.5, 'Заметка: Запись Роквелла #10', ''],
[4, 80, 67.1, 'Заметка: Запись Роквелла #11', ''],
[4, 82.6, 51.3, 'Заметка: Запись Роквелла #12', ''],
[4, 64.1, 61.6, 'Заметка: Запись Роквелла #13', ''],
[4, 58.6, 49, 'Заметка: Запись Роквелла #14', ''],
[4, 70.2, 32, 'Заметка: Запись Роквелла #15', ''],
[4, 69.5, 24.8, 'Заметка: Запись Роквелла #16', ''],
[4, 83.8, 27.7, 'Заметка: Запись Роквелла #19', ''],
[4, 86.4, 26.7, 'Заметка: Запись Роквелла #20', ''],
[4, 77.1, 31.6, 'Заметка: Запись Роквелла #21', ''],
[4, 76, 46.7, 'Заметка: Запись Роквелла #22', ''],
[4, 75.5, 74, 'Заметка: Запись Роквелла #23', ''],
[4, 76.5, 68.1, 'Заметка: Запись Роквелла #24', ''],
[4, 75, 65.6, 'Заметка: Запись Роквелла #25', ''],
[4, 75.8, 75.5, 'Заметка: Запись Роквелла #26', ''],
[4, 20.1, 85.9, 'Заметка: Запись Роквелла #27', ''],
[4, 78.3, 47.3, 'Заметка: Запись Роквелла #28', ''],


];

for (var i in array_markers){// перебераем строки
   var s = array_markers[i];	// s текущая строка
   L.marker({lat:s[1],lng:s[2]},{title:s[3]+" "+s[1]+" "+s[2],icon:markerIconTypes[s[0]]})
   .bindPopup("<font color='#636363'>"+s[3]+"</font><br>"+s[4]+"<br> "+s[1]+" "+s[2]).addTo(layer[src_layer[s[0]][0]]);
//   .bindPopup("<font color='#636363'>"+s[3]+"</font><br>"+s[4]+"<br> "+s[1]+" "+s[2]).addTo(map);
//alert( s[0] );layer["Cave"]
};



/*
// ===============================================================
        	map.on('click', function (e) {
	            var lat = Math.abs(e.latlng.lat);
	            var long = e.latlng.lng;
	
	            message = "<font color='#636363'> GPS:</font> <br>" + //mlat(lat).toFixed(1) + " - "  + mlon(long).toFixed(1)
				 +"<br><font color='#636363'> Lat: "+ lat + " <br> Lon: "+ long + "</font>"
				 ;
//	            message = "<font color='#636363'>РЁРёСЂРѕС‚Р°:</font> " + Math.round(llat) +" <font color='#636363'>|</font> " + 	                       "<font color='#636363'>Р”РѕР»РіРѕС‚Р°:</font> " + Math.round(llong) +
//				"<br><font color='#636363'> Lat: "+ lat.toFixed(3) + " <br> Lon: "+ long + '</font>';
	            popup.setLatLng(e.latlng).setContent(message).openOn(map);
		});
// ===============================================================*		
*/

//	Для Coordinates
	var c = new L.Control.Coordinates();
	c.addTo(map);
	function onMapClick(e) {c.setCoordinates(e);}
	map.on('click', onMapClick);	
